Table of Contents
 Class OpenElementId
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Open element base class POS - class can not be abstract -it causes problems with serialization
[DataContract]
public class OpenElementId : OpenObject
Inheritance
object
OpenObject
OpenElementId
Derived
CheckSection
ConcreteSetup
BeamData
ConnectedMember
ConnectionPoint
PlateData
CrossSection
ReinforcedCrossSection
DappedEnd
ISDModel
LineSupport
CalculationCase
Opening
PatchDevice
Reinforcement
Point3D
PointOnLine3D
PolyLine3D
Region3D
Segment3D
CombiInput
LoadCase
LoadGroup
LoadInPoint
LoadOnLine
LoadOnSurface
PointLoadOnLine
ResultClass
SelectionItemForResults
Settlement
StrainLoadOnLine
TemperatureLoadOnLine
BoltAssembly
Material
CheckMember
DesignMember
Element1D
Element2D
HingeElement1D
InitialImperfectionOfPoint
LineSupportSegment
Member1D
Member2D
PointSupportNode
RebarBase
RebarPatternBase
RebarShape
RigidLink
Span
SubStructure
Taper
Tendon
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Id
Element Id
[DataMember]
public int Id { get; set; }
Property Value
int
 Edit this page